KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB07.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <groupName>DMA</groupName>
      <baseAddress>0x48700000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA</name>
        <description>DMA interrupt</description>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>DMA_ISR</name>
          <displayName>DMA_ISR</displayName>
          <description>DMA_ISR register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>GIF1</name>
              <description>GIF1: Channel 1 global interrupt flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No TE, HT or TC event on channel 1
1: A TE, HT or TC event occurred on channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF1</name>
              <description>TCIF1: Channel 1 transfer complete flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer complete (TC) event on channel 1
1: A transfer complete (TC) event occurred on channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF1</name>
              <description>HTIF1: Channel 1 half transfer flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No half transfer (HT) event on channel 1
1: A half transfer (HT) event occurred on channel 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF1</name>
              <description>TEIF1: Channel 1 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer error (TE) on channel 1
1: A transfer error (TE) occurred on channel 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF2</name>
              <description>GIF2: Channel 2 global interrupt flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No TE, HT or TC event on channel 2
1: A TE, HT or TC event occurred on channel 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF2</name>
              <description>TCIF2: Channel 2 transfer complete flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer complete (TC) event on channel 2
1: A transfer complete (TC) event occurred on channel 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF2</name>
              <description>HTIF2: Channel 2 half transfer flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No half transfer (HT) event on channel 2
1: A half transfer (HT) event occurred on channel 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF2</name>
              <description>TEIF2: Channel 2 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer error (TE) on channel 2
1: A transfer error (TE) occurred on channel 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF3</name>
              <description>GIF3: Channel 3 global interrupt flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No TE, HT or TC event on channel 3
1: A TE, HT or TC event occurred on channel 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF3</name>
              <description>TCIF3: Channel 3 transfer complete flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer complete (TC) event on channel 3
1: A transfer complete (TC) event occurred on channel 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF3</name>
              <description>HTIF3: Channel 3 half transfer flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No half transfer (HT) event on channel 3
1: A half transfer (HT) event occurred on channel 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF3</name>
              <description>TEIF3: Channel 3 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer error (TE) on channel 3
1: A transfer error (TE) occurred on channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF4</name>
              <description>GIF4: Channel 4 global interrupt flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No TE, HT or TC event on channel 4
1: A TE, HT or TC event occurred on channel 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF4</name>
              <description>TCIF4: Channel 4 transfer complete flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer complete (TC) event on channel 4
1: A transfer complete (TC) event occurred on channel 4</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF4</name>
              <description>HTIF4: Channel 4 half transfer flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No half transfer (HT) event on channel 4
1: A half transfer (HT) event occurred on channel 4</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF4</name>
              <description>TEIF4: Channel 4 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer error (TE) on channel 4
1: A transfer error (TE) occurred on channel 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF5</name>
              <description>GIF5: Channel 5 global interrupt flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No TE, HT or TC event on channel 5
1: A TE, HT or TC event occurred on channel 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF5</name>
              <description>TCIF5: Channel 5 transfer complete flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer complete (TC) event on channel 5
1: A transfer complete (TC) event occurred on channel 5</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF5</name>
              <description>HTIF5: Channel 5 half transfer flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No half transfer (HT) event on channel 5
1: A half transfer (HT) event occurred on channel 5</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF5</name>
              <description>TEIF5: Channel 5 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer error (TE) on channel 5
1: A transfer error (TE) occurred on channel 5</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF6</name>
              <description>GIF6: Channel 6 global interrupt flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No TE, HT or TC event on channel 6
1: A TE, HT or TC event occurred on channel 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF6</name>
              <description>TCIF6: Channel 6 transfer complete flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer complete (TC) event on channel 6
1: A transfer complete (TC) event occurred on channel 6</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF6</name>
              <description>HTIF6: Channel 6 half transfer flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No half transfer (HT) event on channel 6
1: A half transfer (HT) event occurred on channel 6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F6</name>
              <description>TEIF6: Channel 6 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer error (TE) on channel 6
1: A transfer error (TE) occurred on channel 6</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF7</name>
              <description>GIF7: Channel 7 global interrupt flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No TE, HT or TC event on channel 7
1: A TE, HT or TC event occurred on channel 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF7</name>
              <description>TCIF7: Channel 7 transfer complete flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer complete (TC) event on channel 7
1: A transfer complete (TC) event occurred on channel 7</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF7</name>
              <description>HTIF7: Channel 7 half transfer flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No half transfer (HT) event on channel 7
1: A half transfer (HT) event occurred on channel 7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F7</name>
              <description>TEIF7: Channel 7 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer error (TE) on channel 7
1: A transfer error (TE) occurred on channel 7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GIF8</name>
              <description>GIF8: Channel 8 global interrupt flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No TE, HT or TC event on channel 8
1: A TE, HT or TC event occurred on channel 8</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF8</name>
              <description>TCIF8: Channel 8 transfer complete flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer complete (TC) event on channel 8
1: A transfer complete (TC) event occurred on channel 8</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HTIF8</name>
              <description>HTIF8: Channel 8 half transfer flag
This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No half transfer (HT) event on channel 8
1: A half transfer (HT) event occurred on channel 8</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TE1F8</name>
              <description>TEIF8: Channel 8 transfer error flag                                                                                                                                                                                                                    This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register.
0: No transfer error (TE) on channel 8
1: A transfer error (TE) occurred on channel 8</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
