KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB07.svd
        <register>
          <name>IO_IEVR</name>
          <displayName>IO_IEVR</displayName>
          <description>IO_IEVR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA0_IEV</name>
              <description>PA0_IEV : Interrupt polarity event for Port A I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA1_IEV</name>
              <description>PA1_IEV : Interrupt polarity event for Port A I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA2_IEV</name>
              <description>PA2_IEV : Interrupt polarity event for Port A I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA3_IEV</name>
              <description>PA3_IEV : Interrupt polarity event for Port A I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA4_IEV</name>
              <description>PA4_IEV : Interrupt polarity event for Port A I/Os.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA5_IEV</name>
              <description>PA5_IEV : Interrupt polarity event for Port A I/Os.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA6_IEV</name>
              <description>PA6_IEV : Interrupt polarity event for Port A I/Os.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA7_IEV</name>
              <description>PA7_IEV : Interrupt polarity event for Port A I/Os.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA8_IEV</name>
              <description>PA8_IEV : Interrupt polarity event for Port A I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_IEV</name>
              <description>PA9_IEV : Interrupt polarity event for Port A I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_IEV</name>
              <description>PA10_IEV : Interrupt polarity event for Port A I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_IEV</name>
              <description>PA11_IEV : Interrupt polarity event for Port A I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA12_IEV</name>
              <description>PA12_IEV : Interrupt polarity event for Port A I/Os.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA13_IEV</name>
              <description>PA13_IEV : Interrupt polarity event for Port A I/Os.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA14_IEV</name>
              <description>PA14_IEV : Interrupt polarity event for Port A I/Os.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA15_IEV</name>
              <description>PA15_IEV : Interrupt polarity event for Port A I/Os.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB0_IEV</name>
              <description>PB0_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_IEV</name>
              <description>PB1_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_IEV</name>
              <description>PB2_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_IEV</name>
              <description>PB3_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_IEV</name>
              <description>PB4_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_IEV</name>
              <description>PB5_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_IEV</name>
              <description>PB6_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_IEV</name>
              <description>PB7_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB8_IEV</name>
              <description>PB8_IEV : Interrupt polarity event for Port B I/Os.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9_IEV</name>
              <description>PB9_IEV : Interrupt polarity event for Port B I/Os.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10_IEV</name>
              <description>PB10_IEV : Interrupt polarity event for Port B I/Os.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB11_IEV</name>
              <description>PB11_IEV : Interrupt polarity event for Port B I/Os.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_IEV</name>
              <description>PB12_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_IEV</name>
              <description>PB13_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_IEV</name>
              <description>PB14_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_IEV</name>
              <description>PB15_IEV : Interrupt polarity event for Port B I/Os.
 0: falling edge / low level.
 1: rising edge / high level.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
